In [1]:
import pandas as pd

In [3]:
data = [(1, 2, 3, 4),
        (5, 6, 7, 8),
        (8, 10, 11, 12),
        (13, 14, 15, 16)]
df = pd.DataFrame(data, 'l1 l2 l3 l4'.split(), 'c1 c2 c3 c4'.split())
df

    c1  c2  c3  c4
l1   1   2   3   4
l2   5   6   7   8
l3   8  10  11  12
l4  13  14  15  16

In [4]:
df['c1']

l1     1
l2     5
l3     8
l4    13
Name: c1, dtype: int64

In [6]:
df[['c3', 'c1']]

    c3  c1
l1   3   1
l2   7   5
l3  11   8
l4  15  13

In [8]:
df[1:3]

    c1  c2  c3  c4
l2   5   6   7   8
l3   8  10  11  12

In [10]:
df[1:][['c3', 'c1']]

    c3  c1
l2   7   5
l3  11   8
l4  15  13

In [13]:
df.loc[['l3', 'l2']]

    c1  c2  c3  c4
l3   8  10  11  12
l2   5   6   7   8

In [15]:
df.loc['l3', 'c2']

10

In [16]:
df.iloc[2, 1]

10

In [17]:
df.loc[['l3', 'l1'], ['c3', 'c4']]

    c3  c4
l3  11  12
l1   3   4

In [18]:
df.iloc[[2, 0], [2, 3]]

    c3  c4
l3  11  12
l1   3   4